; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l7-t1-p2---int100n150-m25---int100c150---s36---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 l6 - location
t0 - truck
p0 p1 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 - fuellevel
)

(:init
(sum level0 level5 level5)
(sum level0 level8 level8)
(sum level0 level11 level11)
(sum level0 level12 level12)
(sum level0 level19 level19)
(sum level0 level20 level20)
(sum level1 level5 level6)
(sum level1 level8 level9)
(sum level1 level11 level12)
(sum level1 level12 level13)
(sum level1 level19 level20)
(sum level1 level20 level21)
(sum level2 level5 level7)
(sum level2 level8 level10)
(sum level2 level11 level13)
(sum level2 level12 level14)
(sum level2 level19 level21)
(sum level2 level20 level22)
(sum level3 level5 level8)
(sum level3 level8 level11)
(sum level3 level11 level14)
(sum level3 level12 level15)
(sum level3 level19 level22)
(sum level3 level20 level23)
(sum level4 level5 level9)
(sum level4 level8 level12)
(sum level4 level11 level15)
(sum level4 level12 level16)
(sum level4 level19 level23)
(sum level4 level20 level24)
(sum level5 level5 level10)
(sum level5 level8 level13)
(sum level5 level11 level16)
(sum level5 level12 level17)
(sum level5 level19 level24)
(sum level5 level20 level25)
(sum level6 level5 level11)
(sum level6 level8 level14)
(sum level6 level11 level17)
(sum level6 level12 level18)
(sum level6 level19 level25)
(sum level6 level20 level26)
(sum level7 level5 level12)
(sum level7 level8 level15)
(sum level7 level11 level18)
(sum level7 level12 level19)
(sum level7 level19 level26)
(sum level7 level20 level27)
(sum level8 level5 level13)
(sum level8 level8 level16)
(sum level8 level11 level19)
(sum level8 level12 level20)
(sum level8 level19 level27)
(sum level8 level20 level28)
(sum level9 level5 level14)
(sum level9 level8 level17)
(sum level9 level11 level20)
(sum level9 level12 level21)
(sum level9 level19 level28)
(sum level9 level20 level29)
(sum level10 level5 level15)
(sum level10 level8 level18)
(sum level10 level11 level21)
(sum level10 level12 level22)
(sum level10 level19 level29)
(sum level10 level20 level30)
(sum level11 level5 level16)
(sum level11 level8 level19)
(sum level11 level11 level22)
(sum level11 level12 level23)
(sum level11 level19 level30)
(sum level11 level20 level31)
(sum level12 level5 level17)
(sum level12 level8 level20)
(sum level12 level11 level23)
(sum level12 level12 level24)
(sum level12 level19 level31)
(sum level12 level20 level32)
(sum level13 level5 level18)
(sum level13 level8 level21)
(sum level13 level11 level24)
(sum level13 level12 level25)
(sum level13 level19 level32)
(sum level13 level20 level33)
(sum level14 level5 level19)
(sum level14 level8 level22)
(sum level14 level11 level25)
(sum level14 level12 level26)
(sum level14 level19 level33)
(sum level14 level20 level34)
(sum level15 level5 level20)
(sum level15 level8 level23)
(sum level15 level11 level26)
(sum level15 level12 level27)
(sum level15 level19 level34)
(sum level15 level20 level35)
(sum level16 level5 level21)
(sum level16 level8 level24)
(sum level16 level11 level27)
(sum level16 level12 level28)
(sum level16 level19 level35)
(sum level16 level20 level36)
(sum level17 level5 level22)
(sum level17 level8 level25)
(sum level17 level11 level28)
(sum level17 level12 level29)
(sum level17 level19 level36)
(sum level17 level20 level37)
(sum level18 level5 level23)
(sum level18 level8 level26)
(sum level18 level11 level29)
(sum level18 level12 level30)
(sum level18 level19 level37)
(sum level18 level20 level38)
(sum level19 level5 level24)
(sum level19 level8 level27)
(sum level19 level11 level30)
(sum level19 level12 level31)
(sum level19 level19 level38)
(sum level19 level20 level39)
(sum level20 level5 level25)
(sum level20 level8 level28)
(sum level20 level11 level31)
(sum level20 level12 level32)
(sum level20 level19 level39)
(sum level20 level20 level40)
(sum level21 level5 level26)
(sum level21 level8 level29)
(sum level21 level11 level32)
(sum level21 level12 level33)
(sum level21 level19 level40)
(sum level21 level20 level41)
(sum level22 level5 level27)
(sum level22 level8 level30)
(sum level22 level11 level33)
(sum level22 level12 level34)
(sum level22 level19 level41)
(sum level22 level20 level42)
(sum level23 level5 level28)
(sum level23 level8 level31)
(sum level23 level11 level34)
(sum level23 level12 level35)
(sum level23 level19 level42)
(sum level23 level20 level43)
(sum level24 level5 level29)
(sum level24 level8 level32)
(sum level24 level11 level35)
(sum level24 level12 level36)
(sum level24 level19 level43)
(sum level24 level20 level44)
(sum level25 level5 level30)
(sum level25 level8 level33)
(sum level25 level11 level36)
(sum level25 level12 level37)
(sum level25 level19 level44)
(sum level25 level20 level45)
(sum level26 level5 level31)
(sum level26 level8 level34)
(sum level26 level11 level37)
(sum level26 level12 level38)
(sum level26 level19 level45)
(sum level26 level20 level46)
(sum level27 level5 level32)
(sum level27 level8 level35)
(sum level27 level11 level38)
(sum level27 level12 level39)
(sum level27 level19 level46)
(sum level27 level20 level47)
(sum level28 level5 level33)
(sum level28 level8 level36)
(sum level28 level11 level39)
(sum level28 level12 level40)
(sum level28 level19 level47)
(sum level28 level20 level48)
(sum level29 level5 level34)
(sum level29 level8 level37)
(sum level29 level11 level40)
(sum level29 level12 level41)
(sum level29 level19 level48)
(sum level29 level20 level49)
(sum level30 level5 level35)
(sum level30 level8 level38)
(sum level30 level11 level41)
(sum level30 level12 level42)
(sum level30 level19 level49)
(sum level30 level20 level50)
(sum level31 level5 level36)
(sum level31 level8 level39)
(sum level31 level11 level42)
(sum level31 level12 level43)
(sum level31 level19 level50)
(sum level31 level20 level51)
(sum level32 level5 level37)
(sum level32 level8 level40)
(sum level32 level11 level43)
(sum level32 level12 level44)
(sum level32 level19 level51)
(sum level32 level20 level52)
(sum level33 level5 level38)
(sum level33 level8 level41)
(sum level33 level11 level44)
(sum level33 level12 level45)
(sum level33 level19 level52)
(sum level33 level20 level53)
(sum level34 level5 level39)
(sum level34 level8 level42)
(sum level34 level11 level45)
(sum level34 level12 level46)
(sum level34 level19 level53)
(sum level34 level20 level54)
(sum level35 level5 level40)
(sum level35 level8 level43)
(sum level35 level11 level46)
(sum level35 level12 level47)
(sum level35 level19 level54)
(sum level35 level20 level55)
(sum level36 level5 level41)
(sum level36 level8 level44)
(sum level36 level11 level47)
(sum level36 level12 level48)
(sum level36 level19 level55)
(sum level36 level20 level56)
(sum level37 level5 level42)
(sum level37 level8 level45)
(sum level37 level11 level48)
(sum level37 level12 level49)
(sum level37 level19 level56)
(sum level37 level20 level57)
(sum level38 level5 level43)
(sum level38 level8 level46)
(sum level38 level11 level49)
(sum level38 level12 level50)
(sum level38 level19 level57)
(sum level38 level20 level58)
(sum level39 level5 level44)
(sum level39 level8 level47)
(sum level39 level11 level50)
(sum level39 level12 level51)
(sum level39 level19 level58)
(sum level39 level20 level59)
(sum level40 level5 level45)
(sum level40 level8 level48)
(sum level40 level11 level51)
(sum level40 level12 level52)
(sum level40 level19 level59)
(sum level40 level20 level60)
(sum level41 level5 level46)
(sum level41 level8 level49)
(sum level41 level11 level52)
(sum level41 level12 level53)
(sum level41 level19 level60)
(sum level41 level20 level61)
(sum level42 level5 level47)
(sum level42 level8 level50)
(sum level42 level11 level53)
(sum level42 level12 level54)
(sum level42 level19 level61)
(sum level42 level20 level62)
(sum level43 level5 level48)
(sum level43 level8 level51)
(sum level43 level11 level54)
(sum level43 level12 level55)
(sum level43 level19 level62)
(sum level43 level20 level63)
(sum level44 level5 level49)
(sum level44 level8 level52)
(sum level44 level11 level55)
(sum level44 level12 level56)
(sum level44 level19 level63)
(sum level44 level20 level64)
(sum level45 level5 level50)
(sum level45 level8 level53)
(sum level45 level11 level56)
(sum level45 level12 level57)
(sum level45 level19 level64)
(sum level45 level20 level65)
(sum level46 level5 level51)
(sum level46 level8 level54)
(sum level46 level11 level57)
(sum level46 level12 level58)
(sum level46 level19 level65)
(sum level46 level20 level66)
(sum level47 level5 level52)
(sum level47 level8 level55)
(sum level47 level11 level58)
(sum level47 level12 level59)
(sum level47 level19 level66)
(sum level47 level20 level67)
(sum level48 level5 level53)
(sum level48 level8 level56)
(sum level48 level11 level59)
(sum level48 level12 level60)
(sum level48 level19 level67)
(sum level49 level5 level54)
(sum level49 level8 level57)
(sum level49 level11 level60)
(sum level49 level12 level61)
(sum level50 level5 level55)
(sum level50 level8 level58)
(sum level50 level11 level61)
(sum level50 level12 level62)
(sum level51 level5 level56)
(sum level51 level8 level59)
(sum level51 level11 level62)
(sum level51 level12 level63)
(sum level52 level5 level57)
(sum level52 level8 level60)
(sum level52 level11 level63)
(sum level52 level12 level64)
(sum level53 level5 level58)
(sum level53 level8 level61)
(sum level53 level11 level64)
(sum level53 level12 level65)
(sum level54 level5 level59)
(sum level54 level8 level62)
(sum level54 level11 level65)
(sum level54 level12 level66)
(sum level55 level5 level60)
(sum level55 level8 level63)
(sum level55 level11 level66)
(sum level55 level12 level67)
(sum level56 level5 level61)
(sum level56 level8 level64)
(sum level56 level11 level67)
(sum level57 level5 level62)
(sum level57 level8 level65)
(sum level58 level5 level63)
(sum level58 level8 level66)
(sum level59 level5 level64)
(sum level59 level8 level67)
(sum level60 level5 level65)
(sum level61 level5 level66)
(sum level62 level5 level67)

(connected l0 l4)
(fuelcost level20 l0 l4)
(connected l0 l5)
(fuelcost level12 l0 l5)
(connected l0 l6)
(fuelcost level8 l0 l6)
(connected l1 l2)
(fuelcost level20 l1 l2)
(connected l1 l6)
(fuelcost level20 l1 l6)
(connected l2 l1)
(fuelcost level20 l2 l1)
(connected l2 l3)
(fuelcost level20 l2 l3)
(connected l3 l2)
(fuelcost level20 l3 l2)
(connected l3 l4)
(fuelcost level11 l3 l4)
(connected l3 l5)
(fuelcost level20 l3 l5)
(connected l3 l6)
(fuelcost level5 l3 l6)
(connected l4 l0)
(fuelcost level20 l4 l0)
(connected l4 l3)
(fuelcost level11 l4 l3)
(connected l4 l6)
(fuelcost level19 l4 l6)
(connected l5 l0)
(fuelcost level12 l5 l0)
(connected l5 l3)
(fuelcost level20 l5 l3)
(connected l6 l0)
(fuelcost level8 l6 l0)
(connected l6 l1)
(fuelcost level20 l6 l1)
(connected l6 l3)
(fuelcost level5 l6 l3)
(connected l6 l4)
(fuelcost level19 l6 l4)

(at t0 l2)
(fuel t0 level67)
(= (total-cost) 0)

(at p0 l3)
(at p1 l2)
)

(:goal
(and
(at p0 l0)
(at p1 l5)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p1 t0 l2)
   deleted: (at p1 l2)
   added: (in p1 t0)
   goals met: 0 of 2
2. (drive t0 l2 l3 level47 level20 level67)
   deleted: (at t0 l2) (fuel t0 level67)
   added: (at t0 l3) (fuel t0 level47)
   goals met: 0 of 2
3. (load p0 t0 l3)
   deleted: (at p0 l3)
   added: (in p0 t0)
   goals met: 0 of 2
4. (drive t0 l3 l5 level27 level20 level47)
   deleted: (at t0 l3) (fuel t0 level47)
   added: (at t0 l5) (fuel t0 level27)
   goals met: 0 of 2
5. (unload p1 t0 l5)
   deleted: (in p1 t0)
   added: (at p1 l5)
   goals met: 1 of 2
6. (drive t0 l5 l0 level15 level12 level27)
   deleted: (at t0 l5) (fuel t0 level27)
   added: (at t0 l0) (fuel t0 level15)
   goals met: 1 of 2
7. (unload p0 t0 l0)
   deleted: (in p0 t0)
   added: (at p0 l0)
   goals met: 2 of 2
